ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC804/LPC804_LowPower/device/LPC804.h
/*! @name PINASSIGN7 - Pin assign register 7. Assign movable functions LVLSHFT_OUT1, I2C1_SDA, I2C1_SCL, PLU_CLKIN. */
/*! @{ */
#define SWM_PINASSIGN7_LVLSHFT_OUT1_MASK         (0xFFU)
#define SWM_PINASSIGN7_LVLSHFT_OUT1_SHIFT        (0U)
/*! LVLSHFT_OUT1 - LVLSHFT_OUT1 function assignment. The value is the pin number to be assigned to
 *    this function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7
 *    (= 0x7) to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN7_LVLSHFT_OUT1(x)           (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN7_LVLSHFT_OUT1_SHIFT)) & SWM_PINASSIGN7_LVLSHFT_OUT1_MASK)
#define SWM_PINASSIGN7_I2C1_SDA_IO_MASK          (0xFF00U)
#define SWM_PINASSIGN7_I2C1_SDA_IO_SHIFT         (8U)
/*! I2C1_SDA_IO - I2C1_SDA function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN7_I2C1_SDA_IO(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN7_I2C1_SDA_IO_SHIFT)) & SWM_PINASSIGN7_I2C1_SDA_IO_MASK)
#define SWM_PINASSIGN7_I2C1_SCL_IO_MASK          (0xFF0000U)
#define SWM_PINASSIGN7_I2C1_SCL_IO_SHIFT         (16U)
/*! I2C1_SCL_IO - I2C1_SCL function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN7_I2C1_SCL_IO(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN7_I2C1_SCL_IO_SHIFT)) & SWM_PINASSIGN7_I2C1_SCL_IO_MASK)
#define SWM_PINASSIGN7_PLU_CLKIN_IN_MASK         (0xFF000000U)
#define SWM_PINASSIGN7_PLU_CLKIN_IN_SHIFT        (24U)
/*! PLU_CLKIN_IN - PLU_CLKIN function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN7_PLU_CLKIN_IN(x)           (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN7_PLU_CLKIN_IN_SHIFT)) & SWM_PINASSIGN7_PLU_CLKIN_IN_MASK)
/*! @} */

/*! @name PINASSIGN8 - Pin assign register 8. Assign movable functions CAPT_X0, CAPT_X1, CAPT_X2, CAPT_X3. */
/*! @{ */
#define SWM_PINASSIGN8_CAPT_X0_O_MASK            (0xFFU)
#define SWM_PINASSIGN8_CAPT_X0_O_SHIFT           (0U)
/*! CAPT_X0_O - CAPT_X0 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN8_CAPT_X0_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN8_CAPT_X0_O_SHIFT)) & SWM_PINASSIGN8_CAPT_X0_O_MASK)
#define SWM_PINASSIGN8_CAPT_X1_O_MASK            (0xFF00U)
#define SWM_PINASSIGN8_CAPT_X1_O_SHIFT           (8U)
/*! CAPT_X1_O - CAPT_X1 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN8_CAPT_X1_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN8_CAPT_X1_O_SHIFT)) & SWM_PINASSIGN8_CAPT_X1_O_MASK)
#define SWM_PINASSIGN8_CAPT_X2_O_MASK            (0xFF0000U)
#define SWM_PINASSIGN8_CAPT_X2_O_SHIFT           (16U)
/*! CAPT_X2_O - CAPT_X2 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN8_CAPT_X2_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN8_CAPT_X2_O_SHIFT)) & SWM_PINASSIGN8_CAPT_X2_O_MASK)
#define SWM_PINASSIGN8_CAPT_X3_O_MASK            (0xFF000000U)
#define SWM_PINASSIGN8_CAPT_X3_O_SHIFT           (24U)
/*! CAPT_X3_O - CAPT_X3 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN8_CAPT_X3_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN8_CAPT_X3_O_SHIFT)) & SWM_PINASSIGN8_CAPT_X3_O_MASK)
/*! @} */

/*! @name PINASSIGN9 - Pin assign register 9. Assign movable functions CAPT_X4, CAPT_YL, CAPT_YH. */
/*! @{ */
#define SWM_PINASSIGN9_CAPT_X4_O_MASK            (0xFFU)
#define SWM_PINASSIGN9_CAPT_X4_O_SHIFT           (0U)
/*! CAPT_X4_O - CAPT_X4 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN9_CAPT_X4_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN9_CAPT_X4_O_SHIFT)) & SWM_PINASSIGN9_CAPT_X4_O_MASK)
#define SWM_PINASSIGN9_CAPT_YL_O_MASK            (0xFF00U)
#define SWM_PINASSIGN9_CAPT_YL_O_SHIFT           (8U)
/*! CAPT_YL_O - CAPT_YL function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN9_CAPT_YL_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN9_CAPT_YL_O_SHIFT)) & SWM_PINASSIGN9_CAPT_YL_O_MASK)
#define SWM_PINASSIGN9_CAPT_YH_O_MASK            (0xFF0000U)
#define SWM_PINASSIGN9_CAPT_YH_O_SHIFT           (16U)
/*! CAPT_YH_O - CAPT_YH_O function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (=
 *    0x7) to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN9_CAPT_YH_O(x)              (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN9_CAPT_YH_O_SHIFT)) & SWM_PINASSIGN9_CAPT_YH_O_MASK)
/*! @} */

/*! @name PINASSIGN_DATA - Pin assign register */
/*! @{ */
#define SWM_PINASSIGN_DATA_T0_MAT3_MASK          (0xFFU)
#define SWM_PINASSIGN_DATA_T0_MAT3_SHIFT         (0U)
/*! T0_MAT3 - T0_MAT3 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN_DATA_T0_MAT3(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_T0_MAT3_SHIFT)) & SWM_PINASSIGN_DATA_T0_MAT3_MASK)
#define SWM_PINASSIGN_DATA_T0_CAP0_MASK          (0xFF00U)
#define SWM_PINASSIGN_DATA_T0_CAP0_SHIFT         (8U)
/*! T0_CAP0 - T0_CAP0 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN_DATA_T0_CAP0(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_T0_CAP0_SHIFT)) & SWM_PINASSIGN_DATA_T0_CAP0_MASK)
#define SWM_PINASSIGN_DATA_T0_CAP1_MASK          (0xFF0000U)
#define SWM_PINASSIGN_DATA_T0_CAP1_SHIFT         (16U)
/*! T0_CAP1 - T0_CAP1 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN_DATA_T0_CAP1(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_T0_CAP1_SHIFT)) & SWM_PINASSIGN_DATA_T0_CAP1_MASK)
#define SWM_PINASSIGN_DATA_T0_CAP2_MASK          (0xFF000000U)
#define SWM_PINASSIGN_DATA_T0_CAP2_SHIFT         (24U)
/*! T0_CAP2 - T0_CAP2 function assignment. The value is the pin number to be assigned to this
 *    function. The following pins are available: PIO0_0 (= 0) to PIO0_5 (= 0x5) and from PIO0_7 (= 0x7)
 *    to PIO0_30 (= 0x1E).
 */
#define SWM_PINASSIGN_DATA_T0_CAP2(x)            (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGN_DATA_T0_CAP2_SHIFT)) & SWM_PINASSIGN_DATA_T0_CAP2_MASK)
/*! @} */

