ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC804/LPC804_LowPower/device/LPC804.h
/* The count of SWM_PINASSIGN_DATA */
#define SWM_PINASSIGN_DATA_COUNT                 (10U)

/*! @name PINASSIGNFIXED0 - Pin assign to fixed bits register 0. Pin assign to fixed bits register 0. Assign movable functions PLU_INPUT0 to PLU_INPUT5 and PLU_OUT0 to PLU_INPUT7. */
/*! @{ */
#define SWM_PINASSIGNFIXED0_PLU_INPUT0_MASK      (0x3U)
#define SWM_PINASSIGNFIXED0_PLU_INPUT0_SHIFT     (0U)
/*! PLU_INPUT0 - PLU_INPUT0 function assignment.
 *  0b00..Assign to PIO0_00.
 *  0b01..Assign to PIO0_08.
 *  0b10..Assign to PIO0_17.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT0(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT0_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT0_MASK)
#define SWM_PINASSIGNFIXED0_PLU_INPUT1_MASK      (0xCU)
#define SWM_PINASSIGNFIXED0_PLU_INPUT1_SHIFT     (2U)
/*! PLU_INPUT1 - PLU_INPUT1 function assignment
 *  0b00..Assign to PIO0_01.
 *  0b01..Assign to PIO0_09.
 *  0b10..Assign to PIO0_18.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT1(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT1_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT1_MASK)
#define SWM_PINASSIGNFIXED0_PLU_INPUT2_MASK      (0x30U)
#define SWM_PINASSIGNFIXED0_PLU_INPUT2_SHIFT     (4U)
/*! PLU_INPUT2 - PLU_INPUT2 function assignment.
 *  0b00..Assign to PIO0_02.
 *  0b01..Assign to PIO0_10.
 *  0b10..Assign to PIO0_19.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT2(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT2_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT2_MASK)
#define SWM_PINASSIGNFIXED0_PLU_INPUT3_MASK      (0xC0U)
#define SWM_PINASSIGNFIXED0_PLU_INPUT3_SHIFT     (6U)
/*! PLU_INPUT3 - PLU_INPUT3 function assignment.
 *  0b00..Assign to PIO0_03.
 *  0b01..Assign to PIO0_11.
 *  0b10..Assign to PIO0_20.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT3(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT3_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT3_MASK)
#define SWM_PINASSIGNFIXED0_PLU_INPUT4_MASK      (0x300U)
#define SWM_PINASSIGNFIXED0_PLU_INPUT4_SHIFT     (8U)
/*! PLU_INPUT4 - PLU_INPUT4 function assignment.
 *  0b00..Assign to PIO0_04.
 *  0b01..Assign to PIO0_12.
 *  0b10..Assign to PIO0_21.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT4(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT4_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT4_MASK)
#define SWM_PINASSIGNFIXED0_PLU_INPUT5_MASK      (0xC00U)
#define SWM_PINASSIGNFIXED0_PLU_INPUT5_SHIFT     (10U)
/*! PLU_INPUT5 - PLU_INPUT5 function assignment.
 *  0b00..Assign to PIO0_05.
 *  0b01..Assign to PIO0_13.
 *  0b10..Assign to PIO0_22.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_INPUT5(x)        (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_INPUT5_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_INPUT5_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT0_MASK        (0x3000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT0_SHIFT       (12U)
/*! PLU_OUT0 - PLU_OUT0 function assignment.
 *  0b00..Assign to PIO0_07.
 *  0b01..Assign to PIO0_14.
 *  0b10..Assign to PIO0_23.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT0(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT0_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT0_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT1_MASK        (0xC000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT1_SHIFT       (14U)
/*! PLU_OUT1 - PLU_OUT1 function assignment.
 *  0b00..Assign to PIO0_08.
 *  0b01..Assign to PIO0_15.
 *  0b10..Assign to PIO0_24.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT1(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT1_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT1_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT2_MASK        (0x30000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT2_SHIFT       (16U)
/*! PLU_OUT2 - PLU_OUT2 function assignment.
 *  0b00..Assign to PIO0_09.
 *  0b01..Assign to PIO0_16.
 *  0b10..Assign to PIO0_25.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT2(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT2_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT2_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT3_MASK        (0xC0000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT3_SHIFT       (18U)
/*! PLU_OUT3 - PLU_OUT3 function assignment.
 *  0b00..Assign to PIO0_10.
 *  0b01..Assign to PIO0_17.
 *  0b10..Assign to PIO0_26.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT3(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT3_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT3_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT4_MASK        (0x300000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT4_SHIFT       (20U)
/*! PLU_OUT4 - PLU_OUT4 function assignment.
 *  0b00..Assign to PIO0_11.
 *  0b01..Assign to PIO0_18.
 *  0b10..Assign to PIO0_27.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT4(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT4_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT4_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT5_MASK        (0xC00000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT5_SHIFT       (22U)
/*! PLU_OUT5 - PLU_OUT5 function assignment.
 *  0b00..Assign to PIO0_12.
 *  0b01..Assign to PIO0_19.
 *  0b10..Assign to PIO0_28.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT5(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT5_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT5_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT6_MASK        (0x3000000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT6_SHIFT       (24U)
/*! PLU_OUT6 - PLU_OUT6 function assignment.
 *  0b00..Assign to PIO0_13.
 *  0b01..Assign to PIO0_20.
 *  0b10..Assign to PIO0_29.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT6(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT6_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT6_MASK)
#define SWM_PINASSIGNFIXED0_PLU_OUT7_MASK        (0xC000000U)
#define SWM_PINASSIGNFIXED0_PLU_OUT7_SHIFT       (26U)
/*! PLU_OUT7 - PLU_OUT7 function assignment.
 *  0b00..Assign to PIO0_14.
 *  0b01..Assign to PIO0_21.
 *  0b10..Assign to PIO0_30.
 *  0b11..None.
 */
#define SWM_PINASSIGNFIXED0_PLU_OUT7(x)          (((uint32_t)(((uint32_t)(x)) << SWM_PINASSIGNFIXED0_PLU_OUT7_SHIFT)) & SWM_PINASSIGNFIXED0_PLU_OUT7_MASK)
/*! @} */

